Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФИО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТабельныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактныйТелефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>18</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДобавочныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Почта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Сотрудники/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ФИОПриИзменении(Элемент)
    Если Не ПроверитьФИОНаКлиенте(Объект.ФИО) Тогда
        Сообщить("ФИО должно содержать только буквы, пробелы и дефисы!");
        Объект.ФИО = "";
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ПроверитьФИОНаКлиенте(ФИО)
    Попытка
        RegExp = Новый COMОбъект("VBScript.RegExp");
        RegExp.Pattern = "^[А-Яа-яЁё\s-]+$";
        RegExp.IgnoreCase = Ложь;
        Возврат RegExp.Test(ФИО);
    Исключение
        Сообщить("Ошибка при проверке ФИО: " + ОписаниеОшибки());
        Возврат Ложь;
    КонецПопытки;
КонецФункции

&НаКлиенте
Процедура ТабельныйНомерПриИзменении(Элемент)
    Если Не ПроверитьТабельныйНомерНаКлиенте(Объект.ТабельныйНомер) Тогда
        Сообщить("Табельный номер должен состоять ровно из 7 цифр!");
        Объект.ТабельныйНомер = "";
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ПроверитьТабельныйНомерНаКлиенте(ТабельныйНомер)
    Попытка
        RegExp = Новый COMОбъект("VBScript.RegExp");
        RegExp.Pattern = "^\d{7}$";
        RegExp.IgnoreCase = Ложь;
        Возврат RegExp.Test(ТабельныйНомер);
    Исключение
        Сообщить("Ошибка при проверке табельного номера: " + ОписаниеОшибки());
        Возврат Ложь;
    КонецПопытки;
КонецФункции

&НаКлиенте
Функция ПроверитьТелефонНаКлиенте(Телефон)
    Попытка
        RegExp = Новый COMОбъект("VBScript.RegExp");
        RegExp.Pattern = "^\+?\d{1,3}\s?\(\d{3}\)\s?\d{3}-\d{2}-\d{2}$";
        RegExp.IgnoreCase = Ложь;
        Возврат RegExp.Test(Телефон);
    Исключение
        Сообщить("Ошибка при проверке телефона: " + ОписаниеОшибки());
        Возврат Ложь;
    КонецПопытки;
КонецФункции

   
&НаКлиенте
Процедура ПочтаПриИзменении(Элемент)
    Если Не ПроверитьПочтуНаКлиенте(Объект.Почта) Тогда
        Сообщить("Почта должна быть в формате, например, example@domain.ru!");
        Объект.Почта = "";
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ПроверитьПочтуНаКлиенте(Почта)
    Попытка
        RegExp = Новый COMОбъект("VBScript.RegExp");
        RegExp.Pattern = "^[a-zA-Z0-9._%+-]+@[a-zA-Z0-9.-]+\.[a-zA-Z]{2,}$";
        RegExp.IgnoreCase = Ложь;
        Возврат RegExp.Test(Почта);
    Исключение
        Сообщить("Ошибка при проверке почты: " + ОписаниеОшибки());
        Возврат Ложь;
    КонецПопытки;
КонецФункции
